Autodesk.Revit.DB.Visual.Glazing.CommonTintColor
The property labeled "Tint Color" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing.CommonTintToggle
The property labeled "Tint" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing.GlazingNoLevels
The property labeled "Sheets of Glass" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyInteger" within the range of "1, 6".
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing.GlazingReflectance
The property labeled "Reflectance" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing.GlazingColorByObject
The property labeled "Color By Object" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing.GlazingTransmittanceMap
The property labeled "Custom Color" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing.GlazingTransmittanceColor
The property labeled "Color" from the "Glazing" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GlazingTransmittanceColorType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Glazing
Represents the properties of materials.
Since:
2018.1